import { Injectable } from '@nestjs/common';

@Injectable()
export class ProjectsService {
  // constructor() {}

  getProjects() {
    return [
      {
        id: 1,
        title: 'Ингичка вольфрам бойитиш фабрикасини модернизация қилиш',
        location: { lat: 40.12, lng: 69.45 },
      },
      {
        id: 2,
        title:
          '"Ангрен" ва "Янги Ангрен" ИЭСларида техноген чиқиндилари (Ангрен)',
        location: { lat: 40.15, lng: 69.5 },
      },
      {
        id: 3,
        title:
          '"Ангрен" ва "Янги Ангрен" ИЭСларида техноген чиқиндилари (Охангарон)',
        location: { lat: 40.18, lng: 69.55 },
      },
      {
        id: 4,
        title: '"Олмалиқ КМК" АЖ "Қолмақир" кони ағдармалари',
        location: { lat: 40.2, lng: 69.6 },
      },
      {
        id: 5,
        title: '"Олмалиқ КМК" АЖ ювувчи сульфат кислотаси техноген чиқиндилари',
        location: { lat: 40.22, lng: 69.65 },
      },
      {
        id: 6,
        title: '"Марконбулоқ" олтин бойитиш фабрикаси техноген чиқиндилари',
        location: { lat: 40.24, lng: 69.7 },
      },
      {
        id: 7,
        title:
          '"Навоий КМК" АЖ 1-сон Гидрометаллургия заводи техноген чиқинди майдони',
        location: { lat: 40.26, lng: 69.75 },
      },
      {
        id: 8,
        title:
          '"Навоий КМК" АЖ 2-сон Гидрометаллургия заводи техноген чиқинди майдони',
        location: { lat: 40.28, lng: 69.8 },
      },
      {
        id: 9,
        title:
          '"Навоий КМК" АЖ 3-сон Гидрометаллургия заводи техноген чиқинди майдони',
        location: { lat: 40.3, lng: 69.85 },
      },
    ];
  }
}
